function formatOperateId( arr ){
	return arr.map(( item ) => {
		return {
			title : item ,
			key : item ,
			value : item
		}
	});
}
export var operateIds = [
	{
		title : '计数类',
	    children : [
		    {
				value :  '1',
				key : '1',
				title :  '手机APP端',
				selectable : false,
		        children: [
		          	{ 
		          		value : '11', 
		          		key : '11', 
		          		title : '充值相关',
						selectable : false,
		          		children : formatOperateId( [ 'B0001' , 'B0002' , 'B0003' , 'B0004' , 'B0005' ] )
		          	},{ 
		          		value : '12', 
		          		key : '12', 
		          		title : '投递相关' ,
						selectable : false,
		          		children : formatOperateId( [ 'B0006' , 'B0007' , 'B0008' , 'B0009' , 'B0010' , 'B0011' , 'B0012' , 'B0013' , 'B0014' , 'B0015' , 'B0016' , 'B0017' , 'B0018' , 'B0019' , 'B0020' , 'B0021' , 'B0022' , 'B0023' , 'B0024' , 'B0025' , 'B0026' ] )
		          	},{ 
		          		value : '13', 
		          		key : '13', 
		          		title : '消费相关',
						selectable : false,
		          		children : formatOperateId( [ 'B0027' , 'B0028' , 'B0029' , 'B0030' , 'B0031' , 'B0032' , 'B0033' , 'B0034' , 'B0035' ] )
		          	},{ 
		          		value : '14', 
		          		key : '14', 
		          		title : '其他相关',
						selectable : false,
		          		children : formatOperateId( [ 'B0036' , 'B0037' , 'B0038' , 'B0039' , 'B0040' , 'B0041' , 'B0042' , 'B0043' , 'B0044' , 'B0045' , 'B0046' , 'B0047' , 'B0048' , 'B0049' , 'B0050' ] )
		          	},{ 
		          		value : '15', 
		          		key : '15', 
		          		title : '手机投递PlanA',
						selectable : false,
		          		children : formatOperateId( [ 'C0001' , 'C0002' , 'C0003' , 'C0004' , 'C0005' , 'C0006' , 'C0007' , 'C0008' , 'C0009' , 'C0010' , 'C0011' , 'C0012' , 'C0013' , 'C0014' , 'C0015' , 'C0016' , 'C0017' , 'C0018' , 'C0019' , 'C0020' , 'C0021' , 'C0022' , 'C0023' , 'C0024' , 'C0025' , 'C0026' , 'C0027' , 'C0028' , 'C0034' , 'C0035' ] )
		          	},{ 
		          		value : '16', 
		          		key : '16', 
		          		title : '手机投递PlanB',
						selectable : false,
		          		children : formatOperateId( [ 'D0001' , 'D0002' , 'D0004' , 'D0005' , 'D0006' , 'D0007' , 'D0008' , 'D0009' , 'D0010' , 'D0011' , 'D0012' , 'D0014' , 'D0015' , 'D0016' , 'D0017' , 'D0018' , 'D0020' ] )
		          	},{ 
		          		value : '17', 
		          		key : '17', 
		          		title : 'APP预定功能',
						selectable : false,
		          		children : formatOperateId( [ 'E0001' , 'E0002' , 'E0003' , 'E0004' , 'E0005' , 'E0006' , 'E0008' , 'E0009' , 'E0010' , 'E0011' , 'E0012' , 'E0015' , 'E0016' , 'E0017' , 'E0018' , 'E0019' ] )
		          	}
		        ]
		    },{
		        value : '2',
		        key : '2',
		        title : '柜子端',
				selectable : false,
		        children : [
		          	{ 
		          		value : '21', 
		          		key : '21', 
		          		title :  '广告类',
						selectable : false,
		          		children : formatOperateId( [ 'A0001' , 'A0015' , 'A0016' ] )
		          	},{ 
		          		value : '22', 
		          		key : '22', 
		          		title : '用户取件',
						selectable : false,
		          		children : formatOperateId( [ 'A0002' , 'A0003' , 'A0004' ] )
		          	},{ 
		          		value : '23', 
		          		key : '23', 
		          		title : '投递类',
						selectable : false,
		          		children : formatOperateId( [ 'A0006' , 'A0008' , 'A0009' ] )
		          	},{ 
		          		value : '24', 
		          		key : '24', 
		          		title : '其他',
						selectable :false,
		          		children : formatOperateId( [ 'A0007' , 'A0010' , 'A0012' , 'A0013' , 'A0014' ] )
		          	},{ 
		          		value : '25', 
		          		key : '25', 
		          		title : '逾期费用类',
						selectable : false,
		          		children : formatOperateId( [ 'A0017' , 'A0018' , 'A0019' , 'A0020' , 'A0021' , 'A0022' , 'A0023' , 'A0024' , 'A0025' , 'A0026' ] )
		          	}
		        ]
		    }
		]
	},{
	    title : '计时类',
	    children : [
		    {
		        value : '3',
		        key : '3',
		        title : '手机APP端',
				selectable : false,
		        children : [
		          	{ 
		          		value : '31', 
		          		key : '31', 
		          		title : '手机投递PlanA',
						selectable : false,
		          		children : formatOperateId( [ 'C0029' , 'C0030' , 'C0031' , 'C0032' , 'C0033' ] )
		          	},{ 
		          		value : '32', 
		          		key : '32', 
		          		title : '手机投递PlanB',
						selectable : false,
		          		children : formatOperateId( [ 'D0003' , 'D0013' , 'D0019' ] )
		          	}
		        ]
		    },{
		        value : '4',
		        key : '4',
		        title : '柜子端',
				selectable : false,
		        children : [
		          	{ 
		          		value : '41', 
		          		key : '41', 
		          		title : '广告类',
						selectable :false,
		          		children : formatOperateId( [ 'A0005' ] )
		          	},{ 
		          		value : '42', 
		          		key : '42', 
		          		title : '其他',
						selectable : false,
		          		children : formatOperateId( [ 'A0011' ] )
		          	}
		        ]
		    }
		]
	}
];
let operateIdsRemarks = {
	'A0001' : '待机广告点击屏幕',
	'A0002' : '点击“我要取件”',
	'A0003' : '输入取件码取件',
	'A0004' : '进入“取件成功页面”',
	'A0005' : '取件广告播放时长',
	'A0006' : '点击“我是快递员“',
	'A0007' : '点击“快递包裹查询”',
	'A0008' : '点击“用户重发短信”',
	'A0009' : '点击“快递员重发短信”',
	'A0010' : '点击“信用卡还款“',
	'A0011' : '中间按钮进入页面的停留时间',
	'A0012' : '点击“余额查询“',
	'A0013' : '左下角返回按钮点击',
	'A0014' : '非广告页外，所有页面右上角倒计时结束，返回首页',
	'A0015' : '静态广告轮换',
	'A0016' : '取件广告轮换',
	'A0017' : '进入逾期页面',
	'A0018' : '逾期页面取消',
	'A0019' : '逾期页面超时返回',
	'A0020' : '逾期页面支付',
	'A0021' : '支付超时开箱',
	'A0022' : '进入逾期转化页面',
	'A0023' : '逾期转化页面取消',
	'A0024' : '逾期转化页面超时返回',
	'A0025' : '逾期转化页面完成绑定',
	'A0026' : '逾期转化链接超时开箱',
	'B0001' : '右上角充值入口点击',
	'B0002' : '订单生成',
	'B0003' : '支付金额',
	'B0004' : '左上角按钮返回',
	'B0005' : '我的-去充值按钮点击',
	'B0006' : '首页点击我的投递',
	'B0007' : '订单/手机搜索调用',
	'B0008' : '重发取件码按钮点击',
	'B0009' : '拨打电话按钮点击',
	'B0010' : '投递到家按钮',
	'B0011' : '逾期、未取件，已取件tab',
	'B0012' : '已取件我的投递返回按钮',
	'B0013' : '修改手机号调用',
	'B0014' : '首页点击空柜查询',
	'B0015' : '空柜搜索调用',
	'B0016' : '首页常用小区名调用',
	'B0017' : '首页底部扫码摄像头调起',
	'B0018' : '底部扫码登录成功',
	'B0019' : '从扫码页面右上角返回主页',
	'B0020' : '首页点击运单查询',
	'B0021' : '运单查询顶部扫一扫摄像头调起',
	'B0022' : '运单查询调用',
	'B0023' : 'banner点击',
	'B0024' : 'banner展示次数',
	'B0025' : '从我的投递，空柜查询，充值业页，运单查询，右上角按钮返回首页',
	'B0026' : '底部tab',
	'B0027' : '“我要预定”按钮点击',
	'B0028' : '点击“立即预订”',
	'B0029' : '从我要预定右上角按钮返回首页',
	'B0030' : '首页“我要承包”按钮点击',
	'B0031' : '首页入口进入我要承包点击“立即承包”',
	'B0032' : '首页入口进入我要承包并承包成功',
	'B0033' : '空柜搜索结果页我要承包按钮点击',
	'B0034' : '空柜搜索结果页点击“立即承包”',
	'B0035' : '空柜搜索结果页承包成功',
	'B0036' : '退出登录成功',
	'B0037' : '个人信息-申请延期按钮点击',
	'B0038' : '延期成功',
	'B0039' : '个人信息-手机号按钮点击',
	'B0040' : '个人信息-身份证按钮点击',
	'B0041' : '我的-我的预定点击',
	'B0042' : '我的-我的承包点击',
	'B0043' : '我的-账单点击',
	'B0044' : '我的-问题反馈点击',
	'B0045' : '我的-取件人标记管理点击',
	'B0046' : '我的-修改手机号',
	'B0047' : '身份证认证过期触发',
	'B0048' : '完成身份证再认证',
	'B0049' : '完成新用户注册',
	'B0050' : '登录',
	'C0001' : '扫码登录',
	'C0002' : '返回页面',
	'C0003' : '重连次数',
	'C0004' : '返回扫码-网络不太好界面',
	'C0005' : '返回扫码-逾期件界面',
	'C0006' : '逾期处理完毕',
	'C0007' : '返回扫码-包裹投递界面',
	'C0008' : '查看收费规则',
	'C0009' : '登录柜子',
	'C0010' : '返回选择箱子规格',
	'C0011' : '扫不出运单号',
	'C0012' : '返回选择箱子规格',
	'C0013' : '返回扫运单号跳转至手动输入',
	'C0014' : '运单号确认',
	'C0015' : '返回扫运单号',
	'C0016' : '扫不出手机号跳转至手动输入',
	'C0017' : '确认手机号',
	'C0018' : '返回扫手机号码界面',
	'C0019' : '返回首页',
	'C0020' : '确认投递',
	'C0021' : '返回输入手机号界面',
	'C0022' : '确认手机号',
	'C0023' : '开箱未成功',
	'C0024' : '开箱未成功-客服电话',
	'C0025' : '返回订单确认页面',
	'C0026' : '统计选择小箱子的次数',
	'C0027' : '统计选择中箱子的次数',
	'C0028' : '统计选择大箱子的次数',
	'C0029' : '快递柜登录停留时间与次数',
	'C0030' : '扫运单号停留时间与次数',
	'C0031' : '扫手机号停留时间与次数',
	'C0032' : '输入手机号停留时间与次数',
	'C0033' : '确认手机号停留时间与次数',
	'C0034' : '不在白名单跳转到手机号输入',
	'C0035' : '手机号输入后依然不在白名单，跳转到二次确认',
	'D0001' : '扫码登录',
	'D0002' : '返回首页',
	'D0003' : '统计扫码登录时间与次数',
	'D0004' : '返回扫码登录界面',
	'D0005' : '统计选择小箱子的次数',
	'D0006' : '统计选择中箱子的次数',
	'D0007' : '统计选择大箱子的次数',
	'D0008' : '跳转至收费规则界面',
	'D0009' : '返回选择箱子界面',
	'D0010' : '返回选择箱子界面',
	'D0011' : '扫不出单号，手动输入单号',
	'D0012' : '返回扫运单号',
	'D0013' : '扫运单号停留时间与次数',
	'D0014' : '确认运单号',
	'D0015' : '返回主页',
	'D0016' : '确认手机号',
	'D0017' : '返回主页',
	'D0018' : '确认订单',
	'D0019' : '统计输入手机号停留时间与次数',
	'D0020' :'手机号输入后依然不在白名单，跳转到二次确认',
	'E0001' :'空柜查询-首⻚中间的按钮',
	'E0002' : '箱柜预定-⾸⻚页中间的按钮',
	'E0003' : '预定 -所有预定按钮',
	'E0004' : '空柜查询搜索-空柜查询搜索调⽤',
	'E0005' : '箱柜预定⻚页⾯面顶 部tab-点击顶部tab',
	'E0006' : '联系收件宝客服 -我的里面联系收件宝客服按钮',
	'E0008' : '预订箱子-规则',
	'E0009' : '预订箱子-确认支付',
	'E0010' : '预订箱子-确认支付-大叉',
	'E0011' : '预订箱子-充值',
	'E0012' : '预订箱子-充值-大叉',
	'E0015' : '支付结果-返回',
	'E0016' : '空柜查询-返回',
	'E0017' : '支付成功-返回首页',
	'E0018' : '支付成功-查看预订结果',
	'E0019' : '支付成功-我的预订',
}

export function getIdRemark( id ){
	let remark = operateIdsRemarks[ id ];
	remark = remark.length > 10 ? remark.substring( 0 , 10 ) + '...' : remark ;
	return remark;
}